# Perimeter Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralSectionAnalysisParams..::..Perimeter Property
StructuralSectionAnalysisParams Class See Also
---
Painting surface of the unit length.
**Namespace:** Autodesk.Revit.DB.Structure.StructuralSections**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public double Perimeter { get; set; }
```

Visual Basic
---
```text
Public Property Perimeter As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double Perimeter {
	double get ();
	void set (double value);
}
```

# See Also
StructuralSectionAnalysisParams Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace